MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z256VMC4/mcu.h
#define DATA1                         0x00000078      // When the DAC Buffer is not enabled, DATA[11:0] controls the output voltage based on the following formula. V out = V in * (1 + DACDAT0[11:0])/4096. When the DAC buffer is enabled, DATA[11:0] is mapped to the 16-word buffer.


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_SR register.
//
//*****************************************************************************

#define DACBFRPTF                     0x00000002      // DAC Buffer Read Pointer Top Position Flag
#define DACBFRPBF                     0x00000001      // DAC Buffer Read Pointer Bottom Position Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_C0 register.
//
//*****************************************************************************

#define DACEN                         0x00000080      // DAC Enable
#define DACRFS                        0x00000040      // DAC Reference Select
#define DACTRGSEL                     0x00000020      // DAC Trigger Select
#define DACSWTRG                      0x00000010      // DAC Software Trigger
#define LPEN                          0x00000008      // DAC Low Power Control
#define DACBTIEN                      0x00000002      // DAC Buffer Read Pointer Top Flag Interrupt Enable
#define DACBBIEN                      0x00000001      // DAC Buffer Read Pointer Bottom Flag Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_C1 register.
//
//*****************************************************************************

#define DMAEN                         0x00000080      // DMA Enable Select
#define DACBFMD                       0x00000004      // DAC Buffer Work Mode Select
#define DACBFEN                       0x00000001      // DAC Buffer Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the DACx_C2 register.
//
//*****************************************************************************

#define DACBFRP                       0x00000060      // DAC Buffer Read Pointer
#define DACBFUP                       0x00000001      // DAC Buffer Update Pointer


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_SC register.
//
//*****************************************************************************

#define DMA                           0x00000100      // DMA Enable
#define TOF                           0x00000080      // Timer Overflow Flag
#define TOIE                          0x00000040      // Timer Overflow Interrupt Enable
#define CPWMS                         0x00000020      // Center-Aligned PWM Select
#define CMOD                          0x00000030      // Clock Mode Selection
#define PS                            0x0000001C      // Prescale Factor Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CNT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Counter value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_MOD register.
//
//*****************************************************************************

#define MOD                           0x7FFF8000      // Modulo value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnSC register.
//
//*****************************************************************************

#define CHF                           0x00000080      // Channel Flag
#define CHIE                          0x00000040      // Channel Interrupt Enable
#define MSB                           0x00000020      // Channel Mode Select
#define MSA                           0x00000010      // Channel Mode Select
#define ELSB                          0x00000008      // Edge or Level Select
#define ELSA                          0x00000004      // Edge or Level Select
#define DMA                           0x00000001      // DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnV register.
//
//*****************************************************************************

#define VAL                           0x7FFF8000      // Channel Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_STATUS register.
//
//*****************************************************************************

#define TOF                           0x00000100      // Timer Overflow Flag
#define CH5F-CH0F                     0x00007F80      // Channel Flags


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CONF register.
//
//*****************************************************************************

#define TRGSEL                        0x78000000      // Trigger Select
#define CROT                          0x00040000      // Counter Reload On Trigger
#define CSOO                          0x00020000      // Counter Stop On Overflow


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_LTMR64H register.
//
//*****************************************************************************

#define LTH                           0x7FFFFFFF80000000      // Life Timer value


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_LTMR64L register.
//
//*****************************************************************************

#define LTL                           0x7FFFFFFF80000000      // Life Timer value


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_LDVALn register.
//
//*****************************************************************************

#define TSV                           0x7FFFFFFF80000000      // Timer Start Value


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_CVALn register.
//
//*****************************************************************************

#define TVL                           0x7FFFFFFF80000000      // Current Timer Value


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_TCTRLn register.
//
//*****************************************************************************

