MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z256VMC4/mcu.h
#define CHN                           0x00000004      // Chain Mode
#define TIE                           0x00000002      // Timer Interrupt Enable
#define TEN                           0x00000001      // Timer Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the PIT_TFLGn register.
//
//*****************************************************************************

#define TIF                           0x00000001      // Timer Interrupt Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_PSR register.
//
//*****************************************************************************

#define PRESCALE                      0x000003C0      // Prescale Value
#define PBYP                          0x00000004      // Prescaler Bypass
#define PCS                           0x00000006      // Prescaler Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CMR register.
//
//*****************************************************************************

#define COMPARE                       0x7FFF8000      // Compare Value


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CNR register.
//
//*****************************************************************************

#define COUNTER                       0x7FFF8000      // Counter Value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_BR register.
//
//*****************************************************************************

#define SPPR[2:0]                     0x000001C0      // SPI Baud Rate Prescale Divisor
#define SPR[3:0]                      0x00000078      // SPI Baud Rate Divisor


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_C2 register.
//
//*****************************************************************************

#define SPMIE                         0x00000080      // SPI Match Interrupt Enable
#define SPIMODE                       0x00000040      // SPI 8-bit or 16-bit mode
#define TXDMAE                        0x00000020      // Transmit DMA enable
#define MODFEN                        0x00000010      // Master Mode-Fault Function Enable
#define BIDIROE                       0x00000008      // Bidirectional Mode Output Enable
#define RXDMAE                        0x00000004      // Receive DMA enable
#define SPISWAI                       0x00000002      // SPI Stop in Wait Mode
#define SPC0                          0x00000001      // SPI Pin Control 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_C1 register.
//
//*****************************************************************************

#define SPIE                          0x00000080      // SPI Interrupt Enable: for SPRF and MODF (when FIFO is not supported or not enabled) or for read FIFO (when FIFO is supported and enabled)
#define SPE                           0x00000040      // SPI System Enable
#define SPTIE                         0x00000020      // SPI Transmit Interrupt Enable
#define MSTR                          0x00000010      // Master/Slave Mode Select
#define CPOL                          0x00000008      // Clock Polarity
#define CPHA                          0x00000004      // Clock Phase
#define SSOE                          0x00000002      // Slave Select Output Enable
#define LSBFE                         0x00000001      // LSB First (shifter direction)


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_ML register.
//
//*****************************************************************************

#define Bits[7:0]                     0x00007F80      // Hardware compare value (low byte)


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_MH register.
//
//*****************************************************************************

#define Bits[15:8]                    0x00007F80      // Hardware compare value (high byte)


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_DL register.
//
//*****************************************************************************

#define Bits[7:0]                     0x00007F80      // Data (low byte)


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_DH register.
//
//*****************************************************************************

#define Bits[15:8]                    0x00007F80      // Data (high byte)


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_CI register.
//
//*****************************************************************************

#define TXFERR                        0x00000080      // Transmit FIFO error flag
#define RXFERR                        0x00000040      // Receive FIFO error flag
#define TXFOF                         0x00000020      // Transmit FIFO overflow flag
#define RXFOF                         0x00000010      // Receive FIFO overflow flag
#define TNEAREFCI                     0x00000008      // Transmit FIFO nearly empty flag clear interrupt
#define RNFULLFCI                     0x00000004      // Receive FIFO nearly full flag clear interrupt
#define SPTEFCI                       0x00000002      // Transmit FIFO empty flag clear interrupt
#define SPRFCI                        0x00000001      // Receive FIFO full flag clear interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_C3 register.
//
//*****************************************************************************

